idioms = {

"怒髮衝冠":{
    0:{"easy":["努"],"medium":["弩"],"hard":["恕"]},
    1:{"medium":["髮"]},
    2:{"easy":["沖"],"medium":["充"]},
},

"四面楚歌":{
    0:{"easy":["西"],"medium":["死"],"hard":["匹"]},
    2:{"easy":["處"],"hard":["濋"]},
    3:{"easy":["哥"]}
},

"畫蛇添足":{
    0:{"easy":["劃"],"medium":["晝"],"hard":["書"]},
    1:{"easy":["它"]},
    2:{"easy":["填"],"medium":["婖"]}
},

"守株待兔":{
    0:{"easy":["首"],"medium":["宋"],"hard":["宇"]},
    1:{"easy":["珠"],"medium":["殊"],"hard":["朱"]},
    2:{"hard":["侍"]},
    3:{"medium":["免"]}
},

"自相矛盾":{
    0:{"easy":["白"],"medium":["目"],"hard":["由"]},
    1:{"medium":["湘"],"hard":["箱"]},
    2:{"easy":["予"],"medium":["茅"]},
    3:{"easy":["頓"],"medium":["鈍"],"hard":["遁"]}
},

"一鼓作氣":{
    1:{"easy":["股"]},
    2:{"easy":["做"]},
    3:{"easy":["汽"],"medium":["棄"]}
},

"亡羊補牢":{
    0:{"easy":["忘"],"medium":["芒"]},
    2:{"easy":["捕"]}
},

"破釜沉舟":{
    0:{"easy":["坡"],"medium":["波"],"hard":["披"]},
    1:{"easy":["斧"]},
    2:{"medium":["沈"]}
},

"對症下藥":{
    0:{"easy":["隊"],"hard":["對"]},
    1:{"easy":["証"],"medium":["政"]}
},

"刻苦耐勞":{
    0:{"easy":["克"],"medium":["剋"]},
    1:{"easy":["奈"]},
    2:{"easy":["牢"]}
},

"一目了然":{
    1:{"easy":["自"],"medium":["且"],"hard":["日"]},
    2:{"easy":["瞭"]},
    3:{"easy":["燃"],"hard":["染"]}
},

"一箭雙鵰":{
    1:{"easy":["剪"],"medium":["劍"]},
    2:{"hard":["爽"]},
    3:{"easy":["雕"],"medium":["凋"]}
},

"三思而行":{
    1:{"easy":["恩"]}
},

"五花八門":{
    1:{"medium":["化"]},
    2:{"easy":["人"],"medium":["入"]},
    3:{"hard":["們"]}
},

"虎視眈眈":{
    1:{"hard":["示"]},
    2:{"easy":["耽"]},
    3:{"easy":["耽"]}
},

"魚目混珠":{
    0:{"easy":["漁"]},
    1:{"easy":["自"],"medium":["且"],"hard":["日"]},
    2:{"hard":["渾"]},
    3:{"easy":["株"],"hard":["誅"]}
},

"青出於藍":{
    0:{"easy":["清"]},
    2:{"hard":["于"]},
    3:{"medium":["籃"]}
},

"百發百中":{
    0:{"easy":["白"]},
    1:{"medium":["廢"]},
    2:{"easy":["白"]},
    3:{"easy":["忠"],"medium":["仲"]}
},

"當機立斷":{
    0:{"easy":["檔"],"medium":["擋"]},
    1:{"easy":["基"],"hard":["奇"]},
    3:{"easy":["段"],"hard":["鍛"]}
},

"半途而廢":{
    0:{"easy":["牛"],"hard":["丰"]},
    1:{"easy":["圖"],"medium":["徒"],"hard":["徙"]},
    3:{"easy":["費"]}
},

"水落石出":{
    1:{"easy":["洛"],"medium":["絡"],"hard":["駱"]},
    2:{"easy":["右"]}
},

"手忙腳亂":{
    1:{"easy":["茫"],"medium":["盲"],"hard":["芒"]},
    3:{"medium":["辭"]}
},

"心驚膽跳":{
    0:{"easy":["必"]},
    2:{"easy":["擔"],"hard":["憚"]},
    3:{"medium":["挑"],"hard":["眺"]}
},

"名列前茅":{
    0:{"easy":["各"],"hard":["洛"]},
    1:{"medium":["烈"],"hard":["裂"]},
    2:{"medium":["煎"],"hard":["箭"]},
    3:{"medium":["矛"]}
},

"全神貫注":{
    0:{"easy":["金"]},
    1:{"easy":["伸"],"hard":["紳"]},
    2:{"easy":["串"],"medium":["慣"],"hard":["摜"]},
    3:{"easy":["住"],"medium":["註"],"hard":["柱"]}
},

"按部就班":{
    0:{"easy":["案"],"medium":["暗"],"hard":["黯"]},
    1:{"easy":["陪"],"medium":["步"],"hard":["倍"]},
    3:{"easy":["般"],"medium":["斑"],"hard":["搬"]}
},

"前功盡棄":{
    0:{"easy":["剪"],"hard":["煎"]},
    1:{"easy":["工"],"medium":["攻"],"hard":["公"]},
    2:{"easy":["儘"],"medium":["進"],"hard":["禁"]},
    3:{"easy":["氣"]}
},

"持之以恆":{
    0:{"hard":["待"]},
    1:{"easy":["支"]},
    2:{"easy":["已"],"medium":["己"],"hard":["乙"]},
    3:{"easy":["衡"]}
},

"如魚得水":{
    0:{"hard":["奴"]},
    1:{"easy":["漁"]},
    2:{"easy":["德"]}
}

}
options_pool = list("家國山水風雲花草人口手足心肝腦頭耳目鼻口天地日月星空海河湖江田土木火金石")